my-page-load-test.yaml
#config:
#  target: "http://localhost:8080"
#  phases:
#      - duration: 10
#        arrivalRate: 10
#      - duration: 60         # 1분간
#        arrivalRate: 30      # 초당 30명 진입
#        rampTo: 200          # 1분간 선형 증가
#  http:
#    timeout: 60
#
#scenarios:
#  - name: "getMeetingList"
#    flow:
#      - get:
#          url: "/meeting/test"


config:
  target: "http://localhost:8080"
  phases:
    - duration: 10
      arrivalRate: 10
    - duration: 60
      arrivalRate: 30
      rampTo: 200
    - duration: 15
      arrivalRate: 10

  http:
    timeout: 60

  payload:
    path: "payload.csv"
    fields:
      - "lastMeetingDate"
      - "lastMeetingTime"
      - "lastMeetingId"

scenarios:
  - name: "getMeetingList"
    flow:
      - get:
          url: "/meeting/test2?lastMeetingDate={{ lastMeetingDate }}&lastMeetingTime={{ lastMeetingTime }}&lastMeetingId={{ lastMeetingId }}"



#config:
#  target: "http://localhost:8080"
#  phases:
#    - duration: 60
#      arrivalRate: 10
#      rampTo: 100
#  processor: "./functions.js" # JavaScript 파일 경로
#  http:
#    timeout: 60
#
#scenarios:
#  - name: "select myPage"
#    flow:
#      # 1. 요청을 보내기 전에 'setRandomToken' 함수를 실행해서 토큰을 고름
#      - function: "setRandomToken"
#      # 2. 위 함수에서 만든 'token' 변수를 헤더에 담아 요청을 보냄
#      - post:
#          url: "/my-page"
#          headers:
#            Authorization: "Bearer {{ token }}"